import {TravelDestination} from '../types';

export const travelDestinations: TravelDestination[] = [
  {
    id: '1',
    country: 'فيتنام',
    flag: '🇻🇳',
    title: 'اكتشف فيتنام',
    locationTxt: 'هانوي، مدينة هو تشي مين، هوي آن، خليج ها لونغ',
    descriptionSmall:
      'استكشف سحر فيتنام بتجربة لا تُنسى بين الشمال والجنوب. ابدأ رحلتك في هانوي العريقة، حيث التاريخ والمعابد القديمة',
    mainImage:
      'https://images.unsplash.com/photo-1578662996442-48f60103fc96?w=800&q=80',
  },
  {
    id: '2',
    country: 'تايلاند',
    flag: '🇹🇭',
    title: 'اكتشف تايلاند',
    locationTxt: 'بانكوك، فوكيت، شيانغ ماي، كوه ساموي',
    descriptionSmall:
      'استكشف سحر تايلاند بتجربة لا تُنسى بين الشمال والجنوب. ابدأ رحلتك في بانكوك العريقة، حيث التاريخ والمعابد القديمة',
    mainImage:
      'https://images.unsplash.com/photo-1506905925346-21bda4d32df4?w=800&q=80',
  },
  {
    id: '3',
    country: 'اليابان',
    flag: '🇯🇵',
    title: 'اكتشف اليابان',
    locationTxt: 'طوكيو، كيوتو، أوساكا، هيروشيما',
    descriptionSmall:
      'استكشف سحر اليابان بتجربة لا تُنسى بين الشمال والجنوب. ابدأ رحلتك في طوكيو العريقة، حيث التاريخ والمعابد القديمة',
    mainImage:
      'https://images.unsplash.com/photo-1493976040374-85c8e12f0c0e?w=800&q=80',
  },
  {
    id: '4',
    country: 'إندونيسيا',
    flag: '🇮🇩',
    title: 'اكتشف إندونيسيا',
    locationTxt: 'بالي، جاكرتا، جوجياكارتا، لومبوك',
    descriptionSmall:
      'استكشف سحر إندونيسيا بتجربة لا تُنسى بين الشمال والجنوب. ابدأ رحلتك في بالي العريقة، حيث التاريخ والمعابد القديمة',
    mainImage:
      'https://images.unsplash.com/photo-1537953773345-d172ccf13cf1?w=800&q=80',
  },
  {
    id: '5',
    country: 'ماليزيا',
    flag: '🇲🇾',
    title: 'اكتشف ماليزيا',
    locationTxt: 'كوالالمبور، بينانغ، لانكاوي، كوتا كينابالو',
    descriptionSmall:
      'استكشف سحر ماليزيا بتجربة لا تُنسى بين الشمال والجنوب. ابدأ رحلتك في كوالالمبور العريقة، حيث التاريخ والمعابد القديمة',
    mainImage:
      'https://images.unsplash.com/photo-1596422846543-75c6fc197f07?w=800&q=80',
  },
];
